<a href="https://colab.research.google.com/github/eftekhar-hossain/Bangla-News-Comments/blob/master/Lab_03_(Data_Processing).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#ETE-456 Machine Learning Sessional

Lab-03: **Data Preprocessing**

> Objective: 
 1. *Preprocess the data before feeding into the ML models.*

In [1]:
import warnings
warnings.filterwarnings("ignore")

# Import the libraries

In [4]:
import numpy as np          # used for mathmatical functions
import matplotlib.pyplot as plt       #used for ploting
import pandas as pd           # used for importing & managing the database

#Dataset

In [2]:
# Download the data
!wget -O Data.csv https://www.dropbox.com/s/qxz032vedcw4yl0/Data.csv?dl=0

--2021-11-24 03:21:28--  https://www.dropbox.com/s/qxz032vedcw4yl0/Data.csv?dl=0
Resolving www.dropbox.com (www.dropbox.com)... 162.125.2.18, 2620:100:6017:18::a27d:212
Connecting to www.dropbox.com (www.dropbox.com)|162.125.2.18|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/qxz032vedcw4yl0/Data.csv [following]
--2021-11-24 03:21:28--  https://www.dropbox.com/s/raw/qxz032vedcw4yl0/Data.csv
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://uc64b94c4ca29751b488fa0f4f43.dl.dropboxusercontent.com/cd/0/inline/BagM7pFRfG3ISZX7x1OGKnq95E34B1wUU3wAFUC6n9IG2x1DwDFq5vo8ZrvrRDS7CBudjJBkNZxqZH_QSTz33DIOMWYILo-u9g10mLegXzAs0pl8hpCXq_p3uonunTWQNEkVxubtjuJr9bmjqg3UbKjj/file# [following]
--2021-11-24 03:21:28--  https://uc64b94c4ca29751b488fa0f4f43.dl.dropboxusercontent.com/cd/0/inline/BagM7pFRfG3ISZX7x1OGKnq95E34B1wUU3wAFUC6n9IG2x1DwDFq5vo8ZrvrRDS7CBudjJBkNZxqZH_QSTz33DIOMWYILo-u9g10mLegXzAs0pl8hpCXq_p3uonunTWQNEkVxubtjuJr9bmjqg3UbKjj/file
Resolving uc64b94c4ca29751b488fa0f4f43.dl.dropboxusercontent.com (uc64b94c4ca29751b488fa0f4f43.dl.dropboxusercontent.com)... 162.125.2.15, 2620:100:6017:15::a27d:20f
Connecting to uc64b94c4ca29751b488fa0f4f43.dl.dropboxusercontent.com (uc64b94c4ca29751b488fa0f4f43.dl.dropboxusercontent.com)|162.125.2.15|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 226 [text/plain]
Saving to: ‘Data.csv’

Data.csv            100%[===================>]     226  --.-KB/s    in 0s

2021-11-24 03:21:29 (30.9 MB/s) - ‘Data.csv’ saved [226/226]

In [5]:
"""importing the dataset """

dataset = pd.read_csv('Data.csv')
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

now we have split the data into independent & dependent variable.

independent are those that we are going to used for prediction or are the features.

dependent are those that we have to predict

In [6]:
features = dataset[['Country'	,'Age',	'Salary']]  # for independent
target = dataset[['Purchased']]   # for dependent

In [7]:
features

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [8]:
target

  Purchased
0        No
1       Yes
2        No
3        No
4       Yes
5       Yes
6        No
7       Yes
8        No
9       Yes

#Taking care of missing data

In [9]:
from sklearn.impute import SimpleImputer

Here **'sklearn'** means sckit learn which is a package used for machine learning model. It contains many libraries.

**preprocessing** is a library which contains several classes,methods.
From this library we import the `Imputer` class which will allow us 
to take care of the missing data

In [10]:
imputer = SimpleImputer(missing_values=np.nan,strategy = "mean") # imputer is an object of Imputer class 
imputer = imputer.fit(features[['Age','Salary']])

**fit()**: used for generating learning model parameters from training data

**transform()** : parameters generated from fit() method,applied upon model to 
generate transformed data set.

**fit_transform()** : combination of fit() and transform() api on same data set

We fit the imputer object into the X where only column 1 and 2 become fit.
now we have to replace the missing value by mean into X

In [11]:
features[['Age','Salary']]= imputer.transform(features[['Age','Salary']])

In [12]:
features

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

In [13]:
features['Country'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [14]:
features['Country'].value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

#Encoding Categorial data

In [16]:
from sklearn.preprocessing import LabelEncoder,OneHotEncoder

##Label Encoding

In [17]:
labelencoder_f = LabelEncoder()
#the country column is represented by numeric value
features['Country'] = labelencoder_f.fit_transform(features['Country'])

In [18]:
features

   Country        Age        Salary
0        0  44.000000  72000.000000
1        2  27.000000  48000.000000
2        1  30.000000  54000.000000
3        2  38.000000  61000.000000
4        1  40.000000  63777.777778
5        0  35.000000  58000.000000
6        2  38.777778  52000.000000
7        0  48.000000  79000.000000
8        1  50.000000  83000.000000
9        0  37.000000  67000.000000

In [ ]:
dataset[['Country']]

In [28]:
features['Cat_Country'] = dataset['Country']
features

   Country        Age        Salary Cat_Country
0        0  44.000000  72000.000000      France
1        2  27.000000  48000.000000       Spain
2        1  30.000000  54000.000000     Germany
3        2  38.000000  61000.000000       Spain
4        1  40.000000  63777.777778     Germany
5        0  35.000000  58000.000000      France
6        2  38.777778  52000.000000       Spain
7        0  48.000000  79000.000000      France
8        1  50.000000  83000.000000     Germany
9        0  37.000000  67000.000000      France

##One Hot Encoding

But this will create a problem as it consider the 2 as greater than 1 and more. For this the Dummy encoding is used where for a country the value is 1 and for the remaining country 0

In [41]:
encoder=OneHotEncoder(sparse=False)
encoded_labels = pd.DataFrame(encoder.fit_transform(features[['Cat_Country']]))

In [42]:
encoded_labels

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0
5  1.0  0.0  0.0
6  0.0  0.0  1.0
7  1.0  0.0  0.0
8  0.0  1.0  0.0
9  1.0  0.0  0.0

In [44]:
encoder.get_feature_names(['Country'])

array(['Country_France', 'Country_Germany', 'Country_Spain'], dtype=object)

In [43]:
encoded_labels.columns = encoder.get_feature_names(['Country'])

In [45]:
dataset= pd.concat([features, encoded_labels], axis=1)
dataset

   Country        Age  ...  Country_Germany Country_Spain
0        0  44.000000  ...              0.0           0.0
1        2  27.000000  ...              0.0           1.0
2        1  30.000000  ...              1.0           0.0
3        2  38.000000  ...              0.0           1.0
4        1  40.000000  ...              1.0           0.0
5        0  35.000000  ...              0.0           0.0
6        2  38.777778  ...              0.0           1.0
7        0  48.000000  ...              0.0           0.0
8        1  50.000000  ...              1.0           0.0
9        0  37.000000  ...              0.0           0.0

[10 rows x 7 columns]

In [47]:
dataset.columns

Index(['Country', 'Age', 'Salary', 'Cat_Country', 'Country_France',
       'Country_Germany', 'Country_Spain'],
      dtype='object')

##Label Encoding (Target Variable)

In [ ]:
labelencoder_t = LabelEncoder()
target = labelencoder_t.fit_transform(target)
target

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1])

In [54]:
features = dataset[['Country',	'Age',	'Salary']]

#Splitting the Dataset

In [51]:
from sklearn.model_selection import train_test_split

In [55]:
"""Spliting the Dataset into Training Set and Test Set """

X_train,X_test,y_train,y_test=train_test_split(features,target,test_size=0.2,random_state=0)
# random_state = 0 is select to get the same result

In [56]:
print(X_train.shape)
print(X_test.shape)

(8, 3)
(2, 3)

In [57]:
X_train

   Country        Age        Salary
4        1  40.000000  63777.777778
9        0  37.000000  67000.000000
1        2  27.000000  48000.000000
6        2  38.777778  52000.000000
7        0  48.000000  79000.000000
3        2  38.000000  61000.000000
0        0  44.000000  72000.000000
5        0  35.000000  58000.000000

##Feature Scaling

It is necessary because sometimes a large value in the variable can dominate the small value.

These methods are used to center/feature scale the given data. 
It basically helps to normalize the data within a particular range

For this, we use Z-score method.

`Z = (x-mu)/std`

We do this on the training set of data.

1.Fit(): Method calculates the parameters μ and σ and saves them as internal objects.

2.Transform(): Method using these calculated parameters apply the transformation to a particular dataset.

3.Fit_transform(): joins the fit() and transform() method for transformation of dataset.

In [59]:
from sklearn.preprocessing import StandardScaler
X_sc = StandardScaler()
X_train = X_sc.fit_transform(X_train)
X_test = X_sc.transform(X_test)

In [60]:
X_train

array([[ 0.13483997,  0.26306757,  0.12381479],
       [-0.94387981, -0.25350148,  0.46175632],
       [ 1.21355975, -1.97539832, -1.53093341],
       [ 1.21355975,  0.05261351, -1.11141978],
       [-0.94387981,  1.64058505,  1.7202972 ],
       [ 1.21355975, -0.0813118 , -0.16751412],
       [-0.94387981,  0.95182631,  0.98614835],
       [-0.94387981, -0.59788085, -0.48214934]])

#Reference


1.   [SuperDataScience](https://www.superdatascience.com/pages/machine-learning)